EngineEval/app/controllers/annotations_controller.rb

	def create
			@fen=params[:fen].split(" ")[0..3].join(" ")+" 0 1"
			@annotation=Annotation.new
			@annotation.fen=@fen
			@annotation.moves=params[:moves]
			@annotation.parents=params[:parents]
			@annotation.children=params[:children]
			@annotation.dropcount=params[:dropcount]
			@annotation.numvariations=params[:numvariations]
			@annotation.comments=params[:comments]
			@annotation.mainvariations=params[:mainvariations]
			@annotation.version=0

			if @annotation.save
				if Annotation.where(fen:@fen).count>1
					@superceded=Annotation.find_by(fen:@fen,version:1)
					@superceded.date_superceded=DateTime.now
					@superceded.save
---
INSERT INTO "annotations" ("children", "comments", "created_at", "dropcount", "fen", "mainvariations", "moves", "numvariations", "parents", "updated_at", "version") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "annotations".* FROM "annotations" WHERE "annotations"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1'
SELECT COUNT(*) FROM "annotations" WHERE "annotations"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1'
SELECT "annotations".* FROM "annotations" WHERE "annotations"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1' AND "annotations"."version" = 1 LIMIT 1
UPDATE "annotations" SET "date_superceded" = $1, "updated_at" = $2 WHERE "annotations"."id" = 35  [["date_superceded", Tue, 18 Mar 2014 02:08:04 UTC +00:00], ["updated_at", Tue, 18 Mar 2014 02:08:04 UTC +00:00]]

	def get_annotation_data
		@fen_param=params[:fen].split(" ")[0..3].join(" ")+" 0 1"
		if @annotation=Annotation.find_by(fen:@fen_param,version:params[:version])
---
SELECT "annotations".* FROM "annotations" WHERE "annotations"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1' ORDER BY "annotations"."created_at" ASC