EngineEval/app/controllers/annotation_quality_votes_controller.rb

INSERT INTO "annotation_quality_votes" ("annotation_id", "created_at", "updated_at", "user_id", "vote") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["annotation_id", 34], ["created_at", Tue, 18 Mar 2014 02:11:16 UTC +00:00], ["updated_at", Tue, 18 Mar 2014 02:11:16 UTC +00:00], ["user_id", 3], ["vote", 1]]
---
	def create
		@vote=AnnotationQualityVote.new
		@vote.vote=params[:vote].to_i
		@vote.user_id=current_user.user_id
		@vote.annotation_id=params[:annotation_id]
		if @vote.save