EngineEval/app/controllers/evaluations_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1' LIMIT 1
INSERT INTO "positions" ("created_at", "fen", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 18 Mar 2014 23:43:19 UTC +00:00], ["fen", "rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1"], ["updated_at", Tue, 18 Mar 2014 23:43:19 UTC +00:00]]
SELECT "evaluations".* FROM "evaluations" WHERE (fen='rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1' AND nodes IS NOT NULL) ORDER BY nodes DESC, created_at DESC LIMIT 10
---
	def index
		@fen_param=params[:fen].split(" ")[0..3].join(" ")+" 0 1"
		if @position=Position.find_by(fen:@fen_param)
		else
			@position=Position.new
			@position.fen=@fen_param
			@position.save
		end
		@tags={}
		@tags[:tactics]=Tag.where('tag_sum>? AND tags.taggable_id=?',0,@position.id).joins(:taggings).where('taggings.taggable_type'=>"Position",'taggings.tag_category'=>"tactics",'taggings.taggable_id'=>@position.id).distinct.map{|tag|[tag.tag_value,tag.tag_sum]}
		@tags[:positional]=Tag.where('tag_sum>? AND tags.taggable_id=?',0,@position.id).joins(:taggings).where('taggings.taggable_type'=>"Position",'taggings.tag_category'=>"positional",'taggings.taggable_id'=>@position.id).distinct.map{|tag|[tag.tag_value,tag.tag_sum]}
		@tags[:opening]=Tag.where('tag_sum>? AND tags.taggable_id=?',0,@position.id).joins(:taggings).where('taggings.taggable_type'=>"Position",'taggings.tag_category'=>"opening",'taggings.taggable_id'=>@position.id).distinct.map{|tag|[tag.tag_value,tag.tag_sum]}
		@evaluations=Evaluation.where("fen=? AND nodes IS NOT NULL",@fen_param).order("nodes DESC, created_at DESC").limit(10).to_a.push(@position)

INSERT INTO "evaluations" ("created_at", "fen", "position_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 04 Mar 2014 20:26:58 UTC +00:00], ["fen", "rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1"], ["position_id", 13], ["updated_at", Tue, 04 Mar 2014 20:26:58 UTC +00:00]]
INSERT INTO "positions" ("created_at", "fen", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 28 Feb 2014 19:00:35 UTC +00:00], ["fen", "rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR"], ["updated_at", Fri, 28 Feb 2014 19:00:35 UTC +00:00]]
---
	def create
		@fen_param=params[:fen].split(" ")[0..3].join(" ")+" 0 1"
		@evaluation=Evaluation.new
		if user_signed_in?
			@evaluation.user_id=current_user.id
		end
		@evaluation.fen=@fen_param
		@evaluation.position=@position
		@evaluation.save

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = $1 LIMIT 1  [["id", "50"]]
UPDATE "evaluations" SET "nodes" = $1, "seconds_run" = $2, "engine" = $3, "evaluation" = $4, "updated_at" = $5 WHERE "evaluations"."id" = 50  [["nodes", 28], ["seconds_run", 0], ["engine", "Stockfish 09-06-13 64bit"], ["evaluation", #<BigDecimal:3150808,'0.76E0',9(27)>], ["updated_at", Tue, 04 Mar 2014 20:30:53 UTC +00:00]]
---
	def update
		require 'bigdecimal'
		@evaluation=Evaluation.find(params[:id])
		@evaluation.nodes=params[:nodes]
		@evaluation.seconds_run=params[:time].to_i/100
		@evaluation.seldepth=params[:seldepth]
		@evaluation.depth=params[:depth]
		@evaluation.engine=params[:engine]
		@evaluation.evaluation=BigDecimal.new(params[:evaluation])
		@evaluation.save