EngineEval/app/controllers/evaluations_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR' LIMIT 1
---
	def create
		@fen_param=params[:fen].split(" ")[0..3].join(" ")+" 0 1"

		if @position=Position.find_by(fen:@fen_param)