EngineEval/app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."fen" = 'rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1' LIMIT 1
---
	def index
		if params[:fen]
			@fen_param=params[:fen].split(" ")[0..3].join(" ")+" 0 1"
		else
			@fen_param="rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1"
		end

		if @position=Position.find_by(fen:@fen_param)